<a href="https://colab.research.google.com/github/k-ardliyan/learn-data-science/blob/master/Tugas_Hari_2_Pekan_2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
# Persiapan membuat data
import pandas as pd
import random

pelajaran = ['Matematika', 'Fisika', 'Biologi', 'Kimia', 'Geologi', 'Ekonomi']
kelas = ['12A', '12B', '12C', '12D']

hasil_nilai = {
    'siswa_id' : range(1, 21),
    'pelajaran' : [random.choice(pelajaran) for i in range(20)],
    'nilai' : [random.choice(range(0, 100)) for i in range(20)],
    'jenis-kelamin' : [random.choice(['laki-laki', 'perempuan']) for i in range(20)],
    'kelas' : [random.choice(kelas) for i in range(20)]
}

df = pd.DataFrame(hasil_nilai)
df.head()

   siswa_id pelajaran  nilai jenis-kelamin kelas
0         1   Biologi     33     laki-laki   12C
1         2     Kimia     80     laki-laki   12C
2         3   Geologi     78     laki-laki   12C
3         4   Ekonomi     36     perempuan   12A
4         5   Ekonomi     74     perempuan   12A

<h2>Soal 1: Indexing</h2>

1. Lakukan indexing terhadap dataframe untuk mengakses column nilai dan kelas saja
2. Lakukan indexing terhadap dataframe untuk mengakses row 5 sampai 10 beserta column pelajaran dan nilai

In [2]:
# code here
# Indexing untuk menampilkan column nilai dan kelas
df_1 = df[['nilai', 'kelas']]
print(df_1)
print('\n')
# Indexing untuk menampilkan column pelajaran dan nilai baris 5 sampai 10
df_2 = df.loc[4:9, 'pelajaran':'nilai']   # Indexing 4:9 karena nilai awal index = 0
print(df_2)

    nilai kelas
0      33   12C
1      80   12C
2      78   12C
3      36   12A
4      74   12A
5      58   12D
6      35   12B
7      18   12D
8      10   12D
9      10   12D
10      5   12C
11     49   12B
12     73   12A
13      8   12B
14     66   12B
15     42   12A
16      6   12D
17     85   12C
18     61   12D
19     63   12A


    pelajaran  nilai
4     Ekonomi     74
5       Kimia     58
6     Geologi     35
7     Geologi     18
8  Matematika     10
9      Fisika     10

<h2>Soal 2: Filter DataFrame Dengan Boolean</h2>

1. Tampilkan semua data siswa pada mata pelajaran Ekonomi dan Fisika
2. Tampilkan semua data siswa yang mempunyai nilai lebih dari 50 di mata pelajaran Kimia 
3. Tampilkan semua data yang mempunyai nilai lebih dari 70, berjnis kelamin perempuan dan di kelas 12C

In [3]:
# code here
# Menampilkan data siswa pada mata pelajaran Ekonomi dan Fisika
ekonomi = df['pelajaran'] == 'Ekonomi'
fisika = df['pelajaran'] == 'Fisika'
print(df[(ekonomi) | (fisika)])
print('\n')
# Menampilkan data siswa dengan nilai > 50 pada mata pelajaran Ekonomi
lebih50 = df['nilai'] > 50
kimia = df['pelajaran'] == 'Kimia'
print(df[(lebih50) & (kimia)])
print('\n')
# Menampilkan data siswa perempuan dengan nilai > 70 di kelas 12 C
lebih70 = df['nilai'] > 70
kelas12c = df['kelas'] == '12C'
perempuan = df['jenis-kelamin'] == 'perempuan'
print(df[(lebih70) & (kelas12c) & (perempuan)])

    siswa_id pelajaran  nilai jenis-kelamin kelas
3          4   Ekonomi     36     perempuan   12A
4          5   Ekonomi     74     perempuan   12A
9         10    Fisika     10     laki-laki   12D
12        13   Ekonomi     73     perempuan   12A
13        14    Fisika      8     laki-laki   12B
15        16    Fisika     42     perempuan   12A
16        17    Fisika      6     perempuan   12D
17        18    Fisika     85     perempuan   12C
19        20   Ekonomi     63     laki-laki   12A


   siswa_id pelajaran  nilai jenis-kelamin kelas
1         2     Kimia     80     laki-laki   12C
5         6     Kimia     58     perempuan   12D


    siswa_id pelajaran  nilai jenis-kelamin kelas
17        18    Fisika     85     perempuan   12C

<h2>Soal 3: Data Transformation</h2>

lakukan data transformasi terhadap column 'nilai' dengan fungsi transformasi, berikut rumus dari normalisasi

![alt text](https://drive.google.com/uc?id=1wed-EbRSTA0JP1ceDp6lcKBqH2yJ4aa3)

In [4]:
# code here
# Mendefinisikan fungsi normalisasi
def normalisasi(x):
  return (x - x.min()) / (x.max() - x.min())

# Memanggil dan menampilkan hasil dari fungsi normalisasi
df_nilai_normal = df[['nilai']].apply(normalisasi)
df_nilai_normal

     nilai
0   0.3500
1   0.9375
2   0.9125
3   0.3875
4   0.8625
5   0.6625
6   0.3750
7   0.1625
8   0.0625
9   0.0625
10  0.0000
11  0.5500
12  0.8500
13  0.0375
14  0.7625
15  0.4625
16  0.0125
17  1.0000
18  0.7000
19  0.7250